tutorial/programmer-7.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-27 Mon 19:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tutorial #7: Types</title>
<meta name="author" content="Connor Redfern" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../doc-style.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Tutorial #7: Types</h1>
<p>
<a href="programmer-6.html">Prev</a> <a href="../index.html">Up</a> <a href="programmer-8.html">Next</a>
</p>

<p>
Relic has three 'levels' of typechecking, which can be set at the level of the
module or package. They are:
</p>
<dl class="org-dl">
<dt>Dynamic</dt><dd>All typechecking is done dynamically. If a symbol is annotated with
a type, then trying to assign it a value with a different type produces a
warning (but not an error). Trying to use it at runtime as if it had a
different type is an error.</dd>
<dt>Optional</dt><dd>Typechecking is only done at compile time on symbols which have been annotated.</dd>
<dt>Static</dt><dd>Typechecking is always done at compile time. If no annotation is
present, the system will attempt to infer the type.</dd>
</dl>

<div class="org-src-container">
<pre class="src src-relic"><span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">ann</span> my-name <span style="color: #81a2be;">String</span><span style="color: #c5c8c6;">)</span>
<span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">def</span> my-name <span style="color: #8abeb7;">"Alice"</span><span style="color: #c5c8c6;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-relic"><span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">ann</span> add <span style="color: #b5bd68;">Fn</span> <span style="color: #8abeb7;">(</span><span style="color: #81a2be;">Int</span> <span style="color: #81a2be;">Int</span><span style="color: #8abeb7;">)</span> <span style="color: #81a2be;">Int</span><span style="color: #c5c8c6;">)</span>
<span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">def</span> add <span style="color: #b5bd68;">fn</span> <span style="color: #8abeb7;">[</span>x y<span style="color: #8abeb7;">]</span> + x y<span style="color: #c5c8c6;">)</span>


<span style="color: #969896; font-style: italic;">;; Will fail! - proc implicitly sequences actions</span>
<span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">def</span> add <span style="color: #b5bd68;">proc</span> <span style="color: #8abeb7;">[</span>x y<span style="color: #8abeb7;">]</span> + x y<span style="color: #c5c8c6;">)</span>
<span style="color: #969896; font-style: italic;">;; ok :)</span>
<span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">def</span> add <span style="color: #b5bd68;">proc</span> <span style="color: #8abeb7;">[</span>x y<span style="color: #8abeb7;">]</span> <span style="color: #8abeb7;">(</span>+ x y<span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">)</span>
</pre>
</div>

<p>
Relic has subtyping, which follows the rules you would expect:
</p>
<div class="org-src-container">
<pre class="src src-relic"><span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">ann</span> get-x <span style="color: #b5bd68;">Fn</span> <span style="color: #8abeb7;">(</span><span style="color: #b5bd68;">Struct</span> <span style="color: #f0c674;">(</span>x <span style="color: #81a2be;">Int</span><span style="color: #f0c674;">)</span><span style="color: #8abeb7;">)</span> x<span style="color: #c5c8c6;">)</span>
<span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">def</span> get-x <span style="color: #b5bd68;">fn</span> <span style="color: #8abeb7;">[</span>s<span style="color: #8abeb7;">]</span> s.x<span style="color: #c5c8c6;">)</span>

<span style="color: #969896; font-style: italic;">;; subtyping!</span>
<span style="color: #c5c8c6;">(</span>get-x <span style="color: #8abeb7;">(</span><span style="color: #b5bd68;">struct</span> <span style="color: #f0c674;">(</span>x <span style="color: #81a2be;">3</span><span style="color: #f0c674;">)</span> <span style="color: #f0c674;">(</span>y <span style="color: #8abeb7;">"hi"</span><span style="color: #f0c674;">)</span><span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">)</span>
</pre>
</div>

<p>
Relic has System-F like types
</p>
<div class="org-src-container">
<pre class="src src-relic"><span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">ann</span> id <span style="color: #b5bd68;">All</span> <span style="color: #8abeb7;">[</span><span style="color: #81a2be;">A</span><span style="color: #8abeb7;">]</span> <span style="color: #b5bd68;">Fn</span> <span style="color: #8abeb7;">[</span><span style="color: #81a2be;">A</span><span style="color: #8abeb7;">]</span> <span style="color: #81a2be;">A</span><span style="color: #c5c8c6;">)</span>
<span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">def</span> id <span style="color: #b5bd68;">fn</span> <span style="color: #8abeb7;">[</span>x<span style="color: #8abeb7;">]</span> x<span style="color: #c5c8c6;">)</span>
</pre>
</div>

<p>
Relic can also infer, given sufficient annotation within a term, e.g. 
</p>
<div class="org-src-container">
<pre class="src src-relic"><span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">def</span> id-2 all <span style="color: #8abeb7;">[</span><span style="color: #81a2be;">A</span><span style="color: #8abeb7;">]</span> <span style="color: #b5bd68;">fn</span> <span style="color: #8abeb7;">(</span><span style="color: #f0c674;">[</span>x <span style="color: #81a2be;">A</span><span style="color: #f0c674;">]</span><span style="color: #8abeb7;">)</span> x<span style="color: #c5c8c6;">)</span> <span style="color: #969896; font-style: italic;">;; infers as All [A] Fn [A] A</span>
</pre>
</div>

<p>
Finally, there is typing of delimited continuations, which have the form
</p>
<div class="org-src-container">
<pre class="src src-relic"><span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">ann</span> eff <span style="color: #81a2be;">Delimit</span> <span style="color: #81a2be;">Bool</span> <span style="color: #81a2be;">Int</span><span style="color: #c5c8c6;">)</span>
<span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">def</span> eff <span style="color: #8abeb7;">(</span>raise true <span style="color: #81a2be;">2</span><span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">)</span>

<span style="color: #c5c8c6;">()</span>
</pre>
</div>

<p>
<a href="http://lambda-the-ultimate.org/node/606">http://lambda-the-ultimate.org/node/606</a>
</p>


<p>
Example: input.
</p>

<p>
Desire: connect the value provided to the function with 
the output type
</p>


<div class="org-src-container">
<pre class="src src-relic"><span style="color: #c5c8c6;">(</span>variant <span style="color: #81a2be;">NTerm</span> <span style="color: #81a2be;">A</span>
  <span style="color: #8abeb7;">(</span><span style="color: #de935f;">:fail</span> : <span style="color: #81a2be;">NTerm</span> <span style="color: #81a2be;">A</span><span style="color: #8abeb7;">)</span>
  <span style="color: #8abeb7;">(</span><span style="color: #de935f;">:amb</span> : <span style="color: #81a2be;">A</span> -&gt; <span style="color: #81a2be;">A</span> -&gt; <span style="color: #81a2be;">NTerm</span> <span style="color: #81a2be;">A</span><span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">)</span>

 
<span style="color: #c5c8c6;">(</span>control <span style="color: #8abeb7;">(</span>fail 'bad'<span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">)</span> : <span style="color: #81a2be;">Eff</span> <span style="color: #81a2be;">NTerm</span> <span style="color: #81a2be;">Int</span>

<span style="color: #c5c8c6;">(</span>control <span style="color: #8abeb7;">(</span>amb <span style="color: #81a2be;">1</span> <span style="color: #81a2be;">2</span><span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">)</span> : <span style="color: #81a2be;">Eff</span> <span style="color: #81a2be;">NTerm</span> <span style="color: #81a2be;">Int</span>


<span style="color: #81a2be;">List</span> <span style="color: #81a2be;">Int</span>
<span style="color: #c5c8c6;">(</span>handle <span style="color: #8abeb7;">(</span>list <span style="color: #f0c674;">(</span>control <span style="color: #b5bd68;">(</span><span style="color: #de935f;">:amb</span> <span style="color: #81a2be;">1</span> <span style="color: #81a2be;">2</span><span style="color: #b5bd68;">)</span><span style="color: #f0c674;">)</span><span style="color: #8abeb7;">)</span>
  <span style="color: #8abeb7;">(</span><span style="color: #b5bd68;">fn</span> rec <span style="color: #f0c674;">[</span>v k<span style="color: #f0c674;">]</span> <span style="color: #b5bd68;">match</span> v
    <span style="color: #f0c674;">(</span><span style="color: #de935f;">:fail</span> -&gt; <span style="color: #b5bd68;">(</span>list<span style="color: #b5bd68;">)</span><span style="color: #f0c674;">)</span>
    <span style="color: #f0c674;">(</span><span style="color: #de935f;">:choose</span> v1 v2 -&gt; append <span style="color: #b5bd68;">(</span>handle <span style="color: #81a2be;">(</span>k v1<span style="color: #81a2be;">)</span> rec<span style="color: #b5bd68;">)</span> <span style="color: #b5bd68;">(</span>handle <span style="color: #81a2be;">(</span>k v2<span style="color: #81a2be;">)</span> rec<span style="color: #b5bd68;">)</span><span style="color: #f0c674;">)</span>
<span style="color: #969896; font-style: italic;">;; type rules</span>
<span style="color: #969896; font-style: italic;">;; handle e f : e has type "Eff &lt;Fam&gt; &lt;Val&gt;"</span>
<span style="color: #969896; font-style: italic;">;; f has type (All [A] Fn [(Fam A) (Fn [A] Eff Fam Val)] Val) </span>
<span style="color: #969896; font-style: italic;">;; expression has type Val</span>
</pre>
</div>

<p>
Ideally, we can stack effects
</p>

<div class="org-src-container">
<pre class="src src-relic"><span style="color: #c5c8c6;">(</span>variant <span style="color: #81a2be;">NTerm</span> <span style="color: #81a2be;">A</span>
  <span style="color: #8abeb7;">(</span><span style="color: #de935f;">:fail</span> : <span style="color: #81a2be;">NTerm</span> <span style="color: #81a2be;">A</span><span style="color: #8abeb7;">)</span>
  <span style="color: #8abeb7;">(</span><span style="color: #de935f;">:amb</span> : <span style="color: #81a2be;">A</span> -&gt; <span style="color: #81a2be;">A</span> -&gt; <span style="color: #81a2be;">NTerm</span> <span style="color: #81a2be;">A</span><span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">)</span>

 
<span style="color: #c5c8c6;">(</span>control-tag <span style="color: #de935f;">:nterm</span> <span style="color: #8abeb7;">(</span>fail 'bad'<span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">)</span> : <span style="color: #81a2be;">Eff</span>' <span style="color: #c5c8c6;">{</span><span style="color: #8abeb7;">(</span><span style="color: #81a2be;">Pair</span> <span style="color: #de935f;">:nterm</span> <span style="color: #81a2be;">NTerm</span><span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">(</span><span style="color: #81a2be;">Pair</span> <span style="color: #de935f;">:exception</span> <span style="color: #81a2be;">Exception</span><span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">}</span> <span style="color: #81a2be;">Int</span>

<span style="color: #c5c8c6;">(</span>control <span style="color: #8abeb7;">(</span>amb <span style="color: #81a2be;">1</span> <span style="color: #81a2be;">2</span><span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">)</span> : <span style="color: #81a2be;">Eff</span> <span style="color: #81a2be;">NTerm</span> <span style="color: #81a2be;">Int</span>


<span style="color: #81a2be;">List</span> <span style="color: #81a2be;">Int</span>
<span style="color: #c5c8c6;">(</span>handle <span style="color: #8abeb7;">(</span>list <span style="color: #f0c674;">(</span>control <span style="color: #b5bd68;">(</span><span style="color: #de935f;">:amb</span> <span style="color: #81a2be;">1</span> <span style="color: #81a2be;">2</span><span style="color: #b5bd68;">)</span><span style="color: #f0c674;">)</span><span style="color: #8abeb7;">)</span>
  <span style="color: #8abeb7;">(</span><span style="color: #b5bd68;">fn</span> rec <span style="color: #f0c674;">[</span>v k<span style="color: #f0c674;">]</span> <span style="color: #b5bd68;">match</span> v
    <span style="color: #f0c674;">(</span><span style="color: #de935f;">:fail</span> -&gt; <span style="color: #b5bd68;">(</span>list<span style="color: #b5bd68;">)</span><span style="color: #f0c674;">)</span>
    <span style="color: #f0c674;">(</span><span style="color: #de935f;">:choose</span> v1 v2 -&gt; append <span style="color: #b5bd68;">(</span>handle <span style="color: #81a2be;">(</span>k v1<span style="color: #81a2be;">)</span> rec<span style="color: #b5bd68;">)</span> <span style="color: #b5bd68;">(</span>handle <span style="color: #81a2be;">(</span>k v2<span style="color: #81a2be;">)</span> rec<span style="color: #b5bd68;">)</span><span style="color: #f0c674;">)</span>
<span style="color: #969896; font-style: italic;">;; type rules</span>
<span style="color: #969896; font-style: italic;">;; handle e f : e has type "Eff &lt;Fam&gt; &lt;Val&gt;"</span>
<span style="color: #969896; font-style: italic;">;; f has type (All [A] Fn [(Fam A) (Fn [A] Eff Fam Val)] Val) </span>
<span style="color: #969896; font-style: italic;">;; expression has type Val</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-relic"><span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">def</span> <span style="color: #c5c8c6;">)</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-relic"><span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">def</span> or! <span style="color: #b5bd68;">macro</span> <span style="color: #b5bd68;">fn</span> <span style="color: #8abeb7;">(</span>l r<span style="color: #8abeb7;">)</span>
  `<span style="color: #8abeb7;">(</span>handle
     <span style="color: #f0c674;">(</span><span style="color: #b5bd68;">seq</span>
       <span style="color: #b5bd68;">(</span>handle ,l <span style="color: #81a2be;">(</span><span style="color: #b5bd68;">fn</span> rec <span style="color: #c5c8c6;">(</span>r k<span style="color: #c5c8c6;">)</span>
          <span style="color: #b5bd68;">if</span> r
           <span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">seq</span>
             <span style="color: #8abeb7;">(</span>control <span style="color: #de935f;">:true</span><span style="color: #8abeb7;">)</span>
             <span style="color: #8abeb7;">(</span>handle <span style="color: #f0c674;">(</span>k <span style="color: #de935f;">:unit</span><span style="color: #f0c674;">)</span> rec<span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">)</span>
           <span style="color: #c5c8c6;">(</span>control <span style="color: #de935f;">:false</span><span style="color: #c5c8c6;">)</span><span style="color: #81a2be;">)</span><span style="color: #b5bd68;">)</span>
       <span style="color: #b5bd68;">(</span>handle ,r<span style="color: #b5bd68;">)</span>
          <span style="color: #b5bd68;">if</span> r
           <span style="color: #b5bd68;">(</span><span style="color: #b5bd68;">seq</span>
             <span style="color: #81a2be;">(</span>control <span style="color: #de935f;">:true</span><span style="color: #81a2be;">)</span>
             <span style="color: #81a2be;">(</span>handle <span style="color: #c5c8c6;">(</span>k <span style="color: #de935f;">:unit</span><span style="color: #c5c8c6;">)</span> rec<span style="color: #81a2be;">)</span><span style="color: #b5bd68;">)</span>
           <span style="color: #b5bd68;">(</span>control <span style="color: #de935f;">:false</span><span style="color: #b5bd68;">)</span><span style="color: #f0c674;">)</span><span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">)</span>
     
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Connor Redfern</p>
<p class="date">Created: 2024-05-27 Mon 19:03</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
